#开始游戏start.py
print('欢迎来到*****执剑*****')
print('#'*30)
#print('#城阙辅三秦  风烟望五津#\n#与君别离意  同是宦游人#\n#海内存知己  天涯若比邻#\n#无为在歧路  儿女共沾巾#')
#print ("了却君王天下事          赢得生前身后名")
print('#'*30)
print('*'*30)
print(' '*15+'帮助事项'+' '*15)
print('0.新手帮助:当选择地上或地点中的npc进行互动时，默认序号id是从左往右从0开始数，例如:\n这里有：[''死神'']，则死神id是0')
print('1.游戏开源')
print("作者QQ2432541891，有问题请联系")
print(":|"*10)
print(' '*15+'0.1.10.200726_alpha版更新日志'+' '*15)
print("0.增加了任务系统，现在游戏内容更加丰富了")
print("1.修改了技能太极拳的出招")
print("2.采用新版本号")
print("3.新增了几个任务")
print("4.优化算法，提升性能")

print('*'*30)
import random

input()
print(' 系统:>>>>>>>>>>>>你重生了 ')
import jq
import sjk
player_name=jq.jq_start()