#开始游戏start.py
print('欢迎来到*****执剑*****')
print('#'*30)
#print('#城阙辅三秦  风烟望五津#\n#与君别离意  同是宦游人#\n#海内存知己  天涯若比邻#\n#无为在歧路  儿女共沾巾#')
#print ("了却君王天下事          赢得生前身后名")
print('#'*30)
print('*'*30)
print(' '*15+'帮助事项'+' '*15)
print('0.新手帮助:当选择地上或地点中的npc进行互动时，默认序号id是从左往右从0开始数，例如:\n这里有：[''死神'']，则死神id是0')
print('1.游戏开源')
print("作者QQ2432541891，有问题请联系")
print(":|"*10)
print(' '*15+'0.a09版更新日志'+' '*15)
print("0.修复了查看技能详情时无法退出的bug")
print("1.将原本的地图文字方式显示改为图形化显示")
print("2.优化了战斗AI，现在当你普通攻击时npc可能也会使用技能了")
print("3.增加了buff系统（目前没有任何实际效果）")
print("4.优化算法，提升性能")
5

print('*'*30)
import random

input()
print(' 系统:>>>>>>>>>>>>你重生了 ')
import jq
jq.jq_start()